Revit 2024 API
BuiltInFailures.ColorFillFailures.OnlyOneColorFillNonPlan Property
 A Color Fill Legend can only be placed in a Floor Plan View or a Section View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OnlyOneColorFillNonPlan { get; }
Visual Basic
Public Shared ReadOnly Property OnlyOneColorFillNonPlan As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OnlyOneColorFillNonPlan {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ColorFillFailures Class
Autodesk.Revit.DB Namespace